In [0]:
import pandas as pd
import numpy as np

**importing data into pandas frame**

In [33]:
emp_data=pd.read_excel("P02_07.xlsx")
emp_data.head()

   Employee  Gender  Age  ...  Beta Experience  Education  Annual Salary
0         1       1   39  ...               12          4          57700
1         2       0   44  ...                8          6          76400
2         3       0   24  ...                2          4          44000
3         4       1   25  ...                1          4          41600
4         5       0   56  ...               25          8         163900

[5 rows x 7 columns]

In [37]:
emp_data=pd.read_excel("P02_07.xlsx")
emp_data.head()

   Employee  Gender  Age  ...  Beta Experience  Education  Annual Salary
0         1       1   39  ...               12          4          57700
1         2       0   44  ...                8          6          76400
2         3       0   24  ...                2          4          44000
3         4       1   25  ...                1          4          41600
4         5       0   56  ...               25          8         163900

[5 rows x 7 columns]

In [35]:
emp_data.columns

Index(['Employee', 'Gender', 'Age', 'Prior Experience', 'Beta Experience',
       'Education', 'Annual Salary'],
      dtype='object')

In [36]:
emp_data.index

RangeIndex(start=0, stop=204, step=1)

**a. Identify all employees who are male and have exactly 4 years of post secondary education. What is the average salary of these employees**

extracting male data from the employee data

In [38]:
male=emp_data['Gender']==1
male_data=emp_data[male]
male_data.head()

   Employee  Gender  Age  ...  Beta Experience  Education  Annual Salary
0         1       1   39  ...               12          4          57700
3         4       1   25  ...                1          4          41600
5         6       1   41  ...               10          4          72700
6         7       1   33  ...                2          6          60300
8         9       1   51  ...               16          6         131200

[5 rows x 7 columns]

***Extracting Male data based on Education of Exactly 4 years***

In [0]:
Education_male_four_years=male_data["Education"]==4
Education_male_four_years

0       True
3       True
5       True
6      False
8      False
       ...
194     True
195     True
199     True
200     True
201    False
Name: Education, Length: 119, dtype: bool

In [0]:
male_edu_four_years=male_data[Education_male_four_years]
male_edu_four_years

     Employee  Gender  Age  ...  Beta Experience  Education  Annual Salary
0           1       1   39  ...               12          4          57700
3           4       1   25  ...                1          4          41600
5           6       1   41  ...               10          4          72700
16         17       1   50  ...               17          4         115400
18         19       1   34  ...                1          4          55800
..        ...     ...  ...  ...              ...        ...            ...
193       194       1   44  ...               11          4          84900
194       195       1   61  ...               18          4         102600
195       196       1   43  ...                1          4          59000
199       200       1   44  ...               18          4         100000
200       201       1   44  ...                4          4          39300

[69 rows x 7 columns]

In [0]:
average_annual_male_salary=male_edu_four_years['Annual Salary'].mean()
print("Average salary of rupees {} paisa for male employee who has exactly four years of education".format(average_annual_male_salary))

Average salary of rupees 69407.2463768116 paisa for male employee who has exactly four years of education

**saving of file**

In [0]:
male_edu_four_years.to_excel('male edu4 years.xlsx')

***b.	Find the average salary of all female employees who have exactly 4 years of post secondary education. How does this mean compare to the one obtained in part a.***

***extracting female data from the employee data***

In [39]:
female=emp_data['Gender']==0
female_data=emp_data[female]
female_data.head()

   Employee  Gender  Age  ...  Beta Experience  Education  Annual Salary
1         2       0   44  ...                8          6          76400
2         3       0   24  ...                2          4          44000
4         5       0   56  ...               25          8         163900
7         8       0   37  ...                6          4          63500
9        10       0   23  ...                1          4          39200

[5 rows x 7 columns]

**Extracting Female data based on Education of Exactly 4 years**

In [0]:
Education_female_four_years=female_data["Education"]==4
Education_female_four_years

1      False
2       True
4      False
7       True
9       True
       ...
196     True
197     True
198    False
202    False
203     True
Name: Education, Length: 85, dtype: bool

In [0]:
female_edu_four_years=female_data[Education_female_four_years]
female_edu_four_years

     Employee  Gender  Age  ...  Beta Experience  Education  Annual Salary
2           3       0   24  ...                2          4          44000
7           8       0   37  ...                6          4          63500
9          10       0   23  ...                1          4          39200
12         13       0   47  ...                9          4          74500
17         18       0   30  ...                6          4          57800
21         22       0   63  ...               20          4         140400
22         23       0   28  ...                5          4          55400
27         28       0   33  ...                7          4          58800
33         34       0   58  ...               22          4         133100
36         37       0   47  ...               16          4          81300
41         42       0   60  ...               21          4         128200
47         48       0   25  ...                3          4          45500
50         51       0   46  ...               18          4          86900
57         58       0   29  ...                8          4          61700
58         59       0   48  ...                9          4          88200
65         66       0   26  ...               23          4         125100
74         75       0   35  ...                5          4          78200
80         81       0   47  ...                1          4          61400
85         86       0   50  ...                2          4          67000
87         88       0   22  ...                3          4          52000
95         96       0   22  ...                1          4          43800
104       105       0   34  ...                7          4          68100
110       111       0   40  ...                3          4          69800
111       112       0   52  ...                4          4          81300
112       113       0   28  ...                5          4          78400
114       115       0   43  ...               24          4          93700
116       117       0   46  ...                3          4          48300
118       119       0   28  ...               16          4          73300
123       124       0   48  ...                4          4          75300
124       125       0   42  ...               17          4          96900
126       127       0   35  ...                2          4          55200
140       141       0   47  ...                4          4          72200
142       143       0   33  ...                1          4          67900
154       155       0   20  ...                4          4          76000
156       157       0   30  ...               18          4          78500
160       161       0   36  ...               13          4         105000
164       165       0   36  ...                2          4          36800
170       171       0   38  ...                7          4          65000
171       172       0   39  ...               14          4         104500
174       175       0   43  ...                7          4          80100
182       183       0   39  ...                7          4          55800
184       185       0   25  ...                1          4          37600
187       188       0   35  ...                6          4          59400
196       197       0   30  ...                5          4          44800
197       198       0   32  ...                2          4          70500
203       204       0   33  ...               19          4         114500

[46 rows x 7 columns]

In [0]:
average_annual_female_salary=female_edu_four_years['Annual Salary'].mean()
print("Average salary of rupees {} paisa for female employee who has exactly four years of education".format(average_annual_female_salary))

Average salary of rupees 73802.17391304347 paisa for female employee who has exactly four years of education

**saving of file**

In [0]:
female_edu_four_years.to_excel('female edu4 years.xlsx')

**comparing of average salary of male who has four years of primary education and average salary of female who has four years of primary education**

In [0]:
if average_annual_male_salary>average_annual_female_salary:
  print("average annual salary of male employee who as four years of eduction is higherthan the average annual salary of female employee who as four years of eduction")
else:
  print('average annual salary of female employee who as four years of education is higherthan the average annual salary of male employee who as four years of eduction')

average annual salary of female employee who as four years of education is higherthan the average annual salary of male employee who as four years of eduction

**c.	Identify all the employees who have more than 4 years of post secondary education. What proportion of these employees are male?**

**Extraction of data of employees who have more than 4 years of post secondary education**

In [74]:
all_emp=emp_data["Education"]>4
all_emp.head()

0    False
1     True
2    False
3    False
4     True
Name: Education, dtype: bool

In [80]:
emp_more_four=emp_data[all_emp]
emp_more_four.head()

    Employee  Gender  Age  ...  Beta Experience  Education  Annual Salary
1          2       0   44  ...                8          6          76400
4          5       0   56  ...               25          8         163900
6          7       1   33  ...                2          6          60300
8          9       1   51  ...               16          6         131200
10        11       0   31  ...                4          6          62900

[5 rows x 7 columns]

In [86]:
total_emp_four_edu=emp_more_four['Gender'].count()
print("Total employees are {} who as more than four years of education".format(total_emp_four_edu))

Total employees are 60 who as more than four years of education

In [62]:
male_data.head()

   Employee  Gender  Age  ...  Beta Experience  Education  Annual Salary
0         1       1   39  ...               12          4          57700
3         4       1   25  ...                1          4          41600
5         6       1   41  ...               10          4          72700
6         7       1   33  ...                2          6          60300
8         9       1   51  ...               16          6         131200

[5 rows x 7 columns]

In [70]:
male_data["Gender"].count()

119

In [65]:
male_more_four_years=male_data["Education"]>4
male_more_four_years

0      False
3      False
5      False
6       True
8       True
       ...
194    False
195    False
199    False
200    False
201    False
Name: Education, Length: 119, dtype: bool

In [91]:
male_edu_more_four_years=male_data[male_more_four_years]
male_emp_four_years=male_edu_more_four_years['Gender'].count()
print("male employess are {} who as more than four years of eduction".format(male_emp_four_years))

male employess are 32 who as more than four years of eduction

In [96]:
pro_male_emp=male_emp_four_years/total_emp_four_edu
print("proportion of male employess who as more than four years of education is {}".format(pro_male_emp))

proportion of male employess who as more than four years of education is 0.5333333333333333